# UnableToLoadDetailGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..UnableToLoadDetailGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
Unable to load detail group '[Type Name]'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToLoadDetailGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToLoadDetailGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToLoadDetailGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace